app/controllers/comment_points_controller.rb

  def index
    comment_points = CommentPoint.find_by_user(params[:user_id])
---
SELECT "comment_points".* FROM "comment_points" WHERE (user_id = '59')