app/controllers/movie_points_controller.rb

SELECT "movie_points".* FROM "movie_points" WHERE (user_id = '59')
---
  def index
    movie_points = MoviePoint.find_by_user(params[:user_id])

INSERT INTO "movie_points" ("user_id", "movie_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 59], ["movie_id", 9], ["value", -1], ["created_at", "2018-01-19 15:32:35.447943"], ["updated_at", "2018-01-19 15:32:35.447943"]]
---
  def create
    authenticate
    movie_point = MoviePoint.new(movie_point_params)
    movie_point.user = current_user
    if movie_point.save