app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    render json: Movie.all

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."movie_id" = $1  [["movie_id", 10]]
---
  def show
    render json: Movie.find_by_id(params[:id]), serializer: MovieDetailedSerializer, include: 'posts'