app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 54]]
---
  def show
    render json: Post.find_by_id(params[:id]), serializer: PostDetailedSerializer, include: 'comments'