api/app/controllers/comments_controller.rb

  def index
    comments = Comment.find_by_user(params[:user_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 59]]

  def create
    authenticate
    comment = Comment.new(comment_params)
    comment.user_id = current_user.id
    if comment.save
---
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "thirded"], ["post_id", 22], ["user_id", 59], ["created_at", "2018-01-19 15:32:59.262863"], ["updated_at", "2018-01-19 15:32:59.262863"], ["parent_id", 485]]

  def update
    authenticate
    comment = Comment.find_by_id(params[:id])
    authorize comment
    if comment.update(comment_params)
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 660], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "what?!\n"], ["updated_at", "2018-01-19 15:35:35.180461"], ["id", 660]]