api/app/controllers/post_points_controller.rb

  def index
    post_points = PostPoint.find_by_user(params[:user_id])
---
SELECT "post_points".* FROM "post_points" WHERE (user_id = '59')